OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
          String fallback = F("$S");
          fallback += rapi.substring(4);

          DBUGF("Attempting %s", fallback.c_str());

          int ret = rapiSender.sendCmdSync(fallback.c_str());
          if(RAPI_RESPONSE_OK == ret)
          {
            String rapiString = rapiSender.getResponse();
          }
        }
      }

      if (json) {
        s = "{\"cmd\":\""+rapi+"\",\"ret\":\""+rapiString+"\"}";
      } else {
        s += html_escape(rapi);
        s += F("<p>&gt;");
        s += html_escape(rapiString);
      }
    }
    else
    {
      String errorString =
        RAPI_RESPONSE_QUEUE_FULL == ret ? F("RAPI_RESPONSE_QUEUE_FULL") :
        RAPI_RESPONSE_BUFFER_OVERFLOW == ret ? F("RAPI_RESPONSE_BUFFER_OVERFLOW") :
        RAPI_RESPONSE_TIMEOUT == ret ? F("RAPI_RESPONSE_TIMEOUT") :
        RAPI_RESPONSE_OK == ret ? F("RAPI_RESPONSE_OK") :
        RAPI_RESPONSE_NK == ret ? F("RAPI_RESPONSE_NK") :
        RAPI_RESPONSE_INVALID_RESPONSE == ret ? F("RAPI_RESPONSE_INVALID_RESPONSE") :
        RAPI_RESPONSE_CMD_TOO_LONG == ret ? F("RAPI_RESPONSE_CMD_TOO_LONG") :
        RAPI_RESPONSE_BAD_CHECKSUM == ret ? F("RAPI_RESPONSE_BAD_CHECKSUM") :
        RAPI_RESPONSE_BAD_SEQUENCE_ID == ret ? F("RAPI_RESPONSE_BAD_SEQUENCE_ID") :
        RAPI_RESPONSE_ASYNC_EVENT == ret ? F("RAPI_RESPONSE_ASYNC_EVENT") :
        RAPI_RESPONSE_BLOCKED == ret ? F("RAPI_RESPONSE_BLOCKED") :
        F("UNKNOWN");

      if (json) {
        s = "{\"cmd\":\""+rapi+"\",\"error\":\""+errorString+"\"}";
      } else {
        s += html_escape(rapi);
        s += F("<p><strong>Error:</strong>");
        s += errorString;
      }

      code = RAPI_RESPONSE_BLOCKED == ret ? 400 : 500;
    }
  }
  if (false == json) {
    s += F("<script type='text/javascript'>document.getElementById('rapi').focus();</script>");
    s += F("<p></html>\r\n\r\n");
  }

  response->setCode(code);
  response->print(s);
  request->send(response);
}

void handleNotFound(MongooseHttpServerRequest *request)
{
  // Not a dynamic handler, check the static resources
  if(web_static_handle(request)) {
    return;
  }

  DBUG("NOT_FOUND: ");
  dumpRequest(request);

  if(net.isWifiModeAp()) {
    // Redirect to the home page in AP mode (for the captive portal)
    MongooseHttpServerResponseStream *response = request->beginResponseStream();
    response->setContentType(CONTENT_TYPE_HTML);

    String url = F("http://");
    url += net.getIp();

    String s = F("<html>");
    s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
    s += url;
    s += F("\" /></head><body><a href=\"");
    s += url;
    s += F("\">OpenEVSE</a></body></html>");

    response->setCode(301);
    response->addHeader(F("Location"), url);
    response->print(s);
    request->send(response);
  } else {
    request->send(404);
  }
}

void handleHttpsRedirect(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response = request->beginResponseStream();
  response->setContentType(CONTENT_TYPE_HTML);

  String url = F("https://");
  url += request->host().toString();
  url += request->uri().toString();

  String s = F("<html>");
  s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
  s += url;
  s += F("\" /></head><body><a href=\"");
  s += url;
  s += F("\">OpenEVSE</a></body></html>");

  response->setCode(301);
  response->addHeader(F("Location"), url);
  response->print(s);
  request->send(response);
}

void onWsFrame(MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len)
{
  DBUGF("Got message %.*s", len, (const char *)data);
  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, data, len);
  if (!error) {
    if (doc["ping"].is<int8_t>())
      {
        // answer pong
        connection->send("{\"pong\": 1}");
      }

    // Handle load sharing allocation from controller (member side)
    if (doc["loadsharing"].is<JsonObject>()) {
      JsonObject ls = doc["loadsharing"];
      if (ls["target_current"].is<double>()) {
        double targetCurrent = ls["target_current"].as<double>();
        String reason = ls["reason"].is<const char*>() ? ls["reason"].as<String>() : "allocation";

        DBUGF("LoadSharing: Received allocation %.1fA (reason: %s)", targetCurrent, reason.c_str());

        if (loadSharingGroupState.isMember()) {
          loadSharingGroupState.recordAllocationReceived();
          shaper.setLoadSharingLimit(targetCurrent, reason == "failsafe_disabled");
        }
      }
    }
  }
}

// WebSocket handshake authentication gate.
//
// Registered via ->onRequest() on every WebSocket endpoint, so it runs during
// MG_EV_WEBSOCKET_HANDSHAKE_REQUEST — before the 101 Switching Protocols
// response. On failure, requestAuthentication() sends a 401 and sets
// MG_F_SEND_AND_CLOSE; mongoose then skips handshake completion (see
// mongoose.c, MG_EV_WEBSOCKET_HANDSHAKE_REQUEST handling), so no onConnect
// fires and no data is ever pushed to an unauthenticated client. On success we
// return without sending a response and the handshake proceeds normally.
//
// Note: the library dispatches HANDSHAKE_REQUEST to the endpoint's onRequest
// handler when one is set, and onConnect/onFrame at the later HANDSHAKE_DONE /
// FRAME events, so gating here does not interfere with those callbacks.
void onWsAuthenticate(MongooseHttpServerRequest *request)
{
  if(!isAuthenticated(request)) {
    request->requestAuthentication(esp_hostname);
  }
}

void onWsConnect(MongooseHttpWebSocketConnection *connection)
{
  DBUGF("New client connected over ws");

  JsonDocument doc;
  buildStatus(doc);

  // Send only to the client that just connected. This used to call
  // web_server_event(), which broadcasts to every open websocket -- so one
  // client reconnecting pushed a full status to all of them. Under a
  // reconnect storm (a Home Assistant integration retrying, say) that
  // multiplies into a burst of full-status sends against connections that
  // never asked for one, straight into send buffers with no backpressure.
  String json;
  json.reserve(measureJson(doc) + 1);
  serializeJson(doc, json);
  connection->send(json);
}

