OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  server.on("/debug/crash/raw$", [](MongooseHttpServerRequest *request) {
    dumpRequest(request);

    // Not routed through requestPreProcess: that opens a buffered stream
    // response, and the whole point here is to send from a flash mapping
    // instead of buffering the image in a heap that has no room for it.
    if(!isAuthenticated(request)) {
      request->requestAuthentication(esp_hostname);
      return;
    }

    const uint8_t *data = NULL;
    size_t len = 0;
    if(!diagnostics_coredump_image(&data, &len)) {
      MongooseHttpServerResponseStream *response = request->beginResponseStream();
      response->setContentType(CONTENT_TYPE_JSON);
      response->setCode(404);
      response->print(F("{\"msg\":\"none\"}"));
      request->send(response);
      return;
    }

    MongooseHttpServerResponseBasic *response = request->beginResponse();
    response->setCode(200);
    response->setContentType("application/octet-stream");
    response->setContentLength(len);
    response->addHeader(F("Content-Disposition"), F("attachment; filename=\"coredump.bin\""));
    response->addHeader(F("Cache-Control"), F("no-store"));
    response->setContent(data, len);
    request->send(response);
  });

  server.on("/debug/console$")
    ->onRequest(onWsAuthenticate)
    ->onFrame([](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
  });

  SerialDebug.onWrite([](const uint8_t *buffer, size_t size)
  {
    server.sendAll("/debug/console", WEBSOCKET_OP_TEXT, buffer, size);
  });

  server.on("/evse$", [](MongooseHttpServerRequest *request) {
    MongooseHttpServerResponseStream *response;
    if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
      return;
    }

    response->setCode(200);
    response->setContentType(CONTENT_TYPE_TEXT);
    response->addHeader("Access-Control-Allow-Origin", "*");
    SerialEvse.printBuffer(*response);
    request->send(response);
  });

  server.on("/evse/console$")
    ->onRequest(onWsAuthenticate)
    ->onFrame([](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
  });

  SerialEvse.onWrite([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });
  SerialEvse.onRead([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });

  server.on("/ws$")->
    onRequest(onWsAuthenticate)
    ->
    onFrame(onWsFrame)
    ->
    onConnect(onWsConnect);

  server.onNotFound(handleNotFound);

  // Setup load sharing endpoints
  web_server_load_sharing_setup();

  DEBUG.println("Server started");
}

void
web_server_loop() {
  Profile_Start(web_server_loop);

  // Do we need to restart the WiFi?
  if(wifiRestartTime > 0 && millis() > wifiRestartTime) {
    wifiRestartTime = 0;
    net.wifiRestart();
  }

  // Do we need to turn off the access point?
  if(apOffTime > 0 && millis() > apOffTime) {
    apOffTime = 0;
    net.wifiTurnOffAp();
  }

  Profile_End(web_server_loop, 5);
}

void web_server_event(JsonDocument &event)
{
  String json;
  // Reserve up front: the default String growth pattern reallocates on almost
  // every append, and exact-fit reallocs at this frequency are what shreds the
  // heap into unusable fragments.
  json.reserve(measureJson(event) + 1);
  serializeJson(event, json);

  // Drop any client that has stopped draining before adding to its backlog.
  diagnostics_ws_reap();

  server.sendAll("/ws", json);
}
